const qnaire = [
  {
    "type": "MULTI",  //选择框
    "question": "1.第一次发病至今的时间",
    "multiarray": [['0年', '1年', '2年', '3年', '4年', '5年', '6年', '7年', '8年', '9年', '10年'], ['0月', '1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'], ['0天', '1天', '2天', '3天', '4天', '5天', '6天', '7天', '8天', '9天', '10天', '11天', '12天', '13天', '14天', '15天', '16天', '17天', '18天', '19天', '20天', '21天', '22天', '23天', '24天', '25天', '26天', '27天', '28天', '29天', '30天']],
    "multiindex": [0, 0, 0]
  },
  {
    "type": "MULTI",
    "question": "2. 最后一次发病至今时间",
    "multiarray": [['0年', '1年', '2年', '3年', '4年', '5年', '6年', '7年', '8年', '9年', '10年'], ['0月', '1月', '2月', '3月', '4月', '5月', '6月', '7月', '8月', '9月', '10月', '11月', '12月'], ['0天', '1天', '2天', '3天', '4天', '5天', '6天', '7天', '8天', '9天', '10天', '11天', '12天', '13天', '14天', '15天', '16天', '17天', '18天', '19天', '20天', '21天', '22天', '23天', '24天', '25天', '26天', '27天', '28天', '29天', '30天']],
    "multiindex": [0, 0, 0]
  },
  {
    "type": "SCQT", //单选中有拖动条 SCQ为单选
    "question": "3. 发病的次数（连续数天或数周持续症状算为一次发病）",
    "option": {
      "a": "一次",
      "b": "二到十次(请点此选择具体次数)",
      "c": "十次以上"
    },
    "multiarray": ['2次', '3次', '4次', '5次', '6次', '7次', '8次', '9次', '10次'],
    "multiindex": [0]
  },
  {
    "type": "MCQ",   //多选
    "question": "4. 以往发病反复发作频率",
    "option": {
      "a": "每天多次发作",
      "b": "间隔数天",
      "c": "一月至数月发作一次",
      "d": "一年至数年发作一次"
    },
    "optnum": 4
  },
  {
    "type": "MCQ",
    "question": "5. 请描述以往发病时（非本次发病）的不适感",
    "option": {
      "a": "外界物体旋转",
      "b": "自身旋转",
      "c": "头晕，无明显旋转感",
      "d": "直立时（坐位、站位或走路时）难以保持身体平衡",
      "e": "其他",
    },
    "optnum": 5
  },
  {
    "type": "MCQ",
    "question": "6. 以往发病时，头晕或眩晕在什么情况下出现",
    "option": {
      "a": "无明显诱因突然发生",
      "b": "头部转动后发生",
      "c": "从床上坐起或躺下时发生",
      "d": "睡觉翻身时发生",
      "e": "巨大声音诱发",
      "f": "看到复杂的视觉刺激时诱发",
      "g": "其他",
    },
    "optnum": 7
  },
  {
    "type": "MCQ",
    "question": "7. 以往发病眩晕的持续时间",
    "option": {
      "a": "一秒至数秒",
      "b": "一分钟以内",
      "c": "数分钟",
      "d": "数十分至数小时",
      "e": "十余小时至1天",
      "f": "一至数天",
      "g": "数天至数月",
      "h": "一年以上"
    },
    "optnum": 8
  },
  {
    "type": "MCQ",
    "question": "8. 请描述本次发病的不适感",
    "option": {
      "a": "外界物体旋转",
      "b": "自身旋转",
      "c": "头晕，无明显旋转感",
      "d": "直立时（坐位、站位或走路时）难以保持身体平衡",
      "e": "其他"
    },
    "optnum": 5
  },
  {
    "type": "MCQ",
    "question": "9. 本次发病头晕或眩晕在什么情况下出现",
    "option": {
      "a": "无明显诱因突然发生",
      "b": "头部转动后发生",
      "c": "从床上坐起或躺下时发生",
      "d": "睡觉翻身时发生",
      "e": "巨大声音诱发",
      "f": "看到复杂的视觉刺激时诱发",
      "g": "其他",
    },
    "optnum": 7
  },
  {
    "type": "MCQ",
    "question": "10. 本次发病眩晕的持续时间",
    "option": {
      "a": "一秒至数秒",
      "b": "一分钟以内",
      "c": "数分钟",
      "d": "数十分至数小时",
      "e": "十余小时至1天",
      "f": "一至数天",
      "g": "数天至数月",
      "h": "一年以上"
    },
    "optnum": 8
  },
  {
    "type": "MCQ",
    "question": "11. 可以改善眩晕的方法：",
    "option": {
      "a": "保持坐位",
      "b": "保持仰卧位",
      "c": "保持头正中位",
      "d": "一侧偏头",
      "e": "静止不动",
      "f": "无明显减轻因素",
      "g": "自行缓解",
      "h": "药物治疗",
      "i": "其他"
    },
    "optnum": 9
  },
  {
    "type": "MCQ",
    "question": "12. (伴随症状)眩晕发作时会对视力有影响么？",
    "option": {
      "a": "视野变狭隘",
      "b": "看东西有重影（复视）",
      "c": "视物晃动",
      "d": "视物模糊",
      "e": "头晕发作前有闪光感等发光的幻觉、弯曲的光线、闪烁的黑点等视觉先兆表现",
      "f": "其他",
    },
    "optnum": 6
  },
  {
    "type": "MCQ",
    "question": "13. (伴随症状)在头晕发作前后，耳部有什么不适么？",
    "option": {
      "a": "单侧急性听力损失",
      "b": "双侧急性听力损失",
      "c": "耳痛",
      "d": "耳部流脓",
      "e": "耳廓发红",
      "f": "耳鸣",
      "g": "耳闷",
      "h": "耳部出血",
      "i": "尖锐声音不能耐受（听觉过敏)",
    },
    "optnum": 9
  },
  {
    "type": "MCQ",
    "question": "14. (伴随症状)有没有其他和眩晕有关的症状？",
    "option": {
      "a": "心跳加速/心悸/胸部剧烈疼痛",
      "b": "吞咽或说话困难",
      "c": "面瘫",
      "d": "面部/肢体感觉异常",
      "e": "面部/肢体活动障碍",
      "f": "猝然倒下发作（突发晕倒但是意识清醒）",
      "g": "头痛",
      "h": "颈部疼痛",
      "i": "恶心、呕吐、出冷汗",
      "j": "因眩晕而卧床不起",
      "k": "呼吸困难",
      "l": "意识丧失",
      "m": "情绪紧张，躁动",
      "n": "其他",
    },
    "optnum": 14
  },
  {
    "type": "MCQ",
    "question": "15. (药物史)眩晕发生前1月内是否有增加服用如下药物？",
    "option": {
      "a": "降压药或洋地黄类药物",
      "b": "糖尿病药物",
      "c": "抗生素（耳毒性）",
      "d": "抗焦虑/抑郁药等精神药物",
      "e": "抗癫痫药物",
      "f": "镇静剂",
      "g": "抗组胺药",
      "h": "非甾体类消炎药，如阿司匹林、对乙酰氨基酚、吲哚美辛、布洛芬等",
      "i": "化疗药等抗癌药物"
    },
    "optnum": 9
  },
  {
    "type": "MCQ",
    "question": "16. (既往史)是否有以下一种或多种情况？？",
    "option": {
      "a": "偏头痛",
      "b": "耳部疾病",
      "c": "近期耳部手术",
      "d": "近期头部手术",
      "e": "高血压",
      "f": "高血脂",
      "g": "甲状腺疾病",
      "h": "贫血",
      "i": "其他心脏或者循环系统疾病",
      "j": "糖尿病",
      "k": "近期头部外伤",
      "l": "高位脊髓或颈部不适病史",
      "m": "眼部相关疾病（新近更换眼镜，近期眼部手术病史）",
      "n": "心理疾病病史",
      "o": "其他",
    },
    "optnum": 15
  },
  {
    "type": "MCQ",
    "question": "17. (家族史)自身和/或有血缘关系的亲属（请列出关系）是否有以下疾病？",
    "option": {
      "a": "偏头痛",
      "b": "耳石症",
      "c": "梅尼埃病",
      "d": "耳硬化症",
      "e": "家族性发作性共计失调",
      "f": "自身免疫病",
      "g": "神经退行性疾病",
      "h": "其他"
    },
    "optnum": 8
  }
]

module.exports = {
  qnaire: qnaire
}
